Repository: krit1989/checkdarn-app
Catalog: lib/l10n/app_*.arb
Languages: th

# noPermissionToVote
source: No permission to vote Try logging out and logging in again
th: ไม่มีสิทธิ์ในการโหวต ลองออกจากระบบและล็อกอินใหม่

# reportNotFound
source: Report not found, may have been deleted
th: ไม่พบรายงานนี้ อาจถูกลบไปแล้ว

# connectionProblem
source: Connection problem Please check your internet and try again
th: ปัญหาการเชื่อมต่อ กรุณาตรวจสอบอินเทอร์เน็ตและลองใหม่

# cannotVoteRetry
source: Cannot vote, please try again
th: ไม่สามารถโหวตได้ กรุณาลองใหม่

source: Retry
th: ลองใหม่

# loginRequiredForStats
source: Login required to view statistics
th: จำเป็นต้องล็อกอินเพื่อดูสถิติ

source: Contribution Score
th: คะแนนการมีส่วนร่วม

source: Total Contributions
th: การมีส่วนร่วมทั้งหมด

source: Reports Submitted
th: รายงานส่ง

source: Votes Given
th: โหวตให้

source: Community Impact
th: ผลกระทบต่อชุมชน

# communityImpactDescription
source: Your participation helps: • Speed camera data accuracy • Community has up-to-date information • Safer driving experience
th: การมีส่วนร่วมของคุณช่วยให้: • ข้อมูลกล้องจับความเร็วมีความแม่นยำ • ชุมชนมีข้อมูลที่ทันสมัย • การขับขี่ปลอดภัยยิ่งขึ้น

# leaderboardAndRewards
source: Leaderboard and special rewards
th: อันดับผู้มีส่วนร่วม และรางวัลพิเศษ

# loginThroughMapProfileRequired
source: Please login through map profile before voting
th: กรุณาล็อกอินผ่านหน้าแผนที่ก่อนโหวต

# reportSubmissionSuccess
source: Report submitted successfully! Check in voting tab
th: ส่งรายงานเรียบร้อยแล้ว! ตรวจสอบในแท็บโหวต

# errorOccurred
source: Error occurred: {error}
th: เกิดข้อผิดพลาด: {error}

source: Show posts from nationwide
th: แสดงโพสต์จากทั่วประเทศ

source: Show nearby posts
th: แสดงโพสต์ใกล้เคียง

# radiusAllPosts
source: Radius: {radius} km. • All posts: {count}
th: รัศมี: {radius} กม. • โพสต์ทั้งหมด: {count}

# radiusNearbyPosts
source: Radius: {radius} km. • Nearby posts: {count}
th: รัศมี: {radius} กม. • โพสต์ใกล้เคียง: {count}

source: Please login through map profile
th: กรุณาล็อกอินผ่านโปรไฟล์ในหน้าแผนที่

# tapProfileButtonInMap
source: Tap profile button at top right of map
th: แตะที่ปุ่มโปรไฟล์มุมขวาบนของแผนที่

# voteExistsSuccess
source: Vote "Exists" submitted successfully
th: โหวต "มีจริง" เรียบร้อยแล้ว

# voteNotExistsSuccess
source: Vote "Doesn't exist" submitted successfully
th: โหวต "ไม่มี" เรียบร้อยแล้ว

# cameraReportFormTitle
source: Speed Camera Report
th: รายงานกล้องจับความเร็ว

# reportTypeLabel
source: Report Type
th: ประเภทการรายงาน

# newCameraLocationLabel
source: New Camera Location
th: ตำแหน่งกล้องใหม่

source: Select New Camera Location
th: เลือกตำแหน่งกล้องใหม่

# selectLocationOnMap
source: Please select location on map
th: กรุณาเลือกตำแหน่งบนแผนที่

# roadNameLabel
source: Road Name
th: ชื่อถนน

source: Please enter road name
th: กรุณากรอกชื่อถนน

# speedLimitLabel
source: Speed Limit (km/h)
th: จำกัดความเร็ว (km/h)

# newSpeedLimitLabel
source: New Speed Limit (km/h)
th: จำกัดความเร็วใหม่ (km/h)

# additionalDetailsLabel
source: Additional Details
th: รายละเอียดเพิ่มเติม

# selectExistingCameraLabel
source: Select existing camera from system
th: เลือกกล้องที่มีอยู่ในระบบ

# selectedLocationLabel
source: Selected Location
th: ตำแหน่งที่เลือก

source: Tap to select location on map
th: แตะเพื่อเลือกตำแหน่งบนแผนที่

# locationDetailsLabel
source: Location details and landmarks
th: รายละเอียดที่ตั้งและจุดสังเกต

# pleaseProvideLocationDetails
source: Please provide location details and landmarks
th: กรุณาระบุรายละเอียดที่ตั้งและจุดสังเกต

source: Please provide at least 10 characters
th: กรุณาระบุรายละเอียดอย่างน้อย 10 ตัวอักษร

source: Report New Camera
th: เพิ่มกล้องใหม่

source: Report Removed Camera
th: กล้องที่ถูกถอน

# reportSpeedChanged
source: Report Speed Limit Changed
th: เปลี่ยนจำกัดความเร็ว

source: No location data found
th: ไม่พบข้อมูลสถานที่

# loginRequiredToViewStats
source: Login required to view statistics
th: จำเป็นต้องล็อกอินเพื่อดูสถิติ

source: Security check failed
th: การตรวจสอบความปลอดภัยล้มเหลว

# pleaseLoginBeforeVoting
source: Please login through map page before voting
th: กรุณาล็อกอินผ่านหน้าแผนที่ก่อนโหวต

# alreadyVotedDetected
source: Vote completed! (System detected you have already voted)
th: โหวตเรียบร้อยแล้ว! (ระบบตรวจสอบว่าคุณได้โหวตแล้ว)

# noVotingPermission
source: No voting permission Try logout and login again
th: ไม่มีสิทธิ์ในการโหวต ลองออกจากระบบและล็อกอินใหม่

source: Engagement Score
th: คะแนนการมีส่วนร่วม

source: Total Engagement
th: การมีส่วนร่วมทั้งหมด

source: Vote For
th: โหวตให้

source: Loading camera data...
th: กำลังโหลดข้อมูลกล้อง...

# noCameraDataFound
source: No camera data found in system
th: ไม่พบข้อมูลกล้องในระบบ

source: Selected Camera
th: กล้องที่เลือก

source: Tap to select camera from map
th: แตะเพื่อเลือกกล้องจากแผนที่

source: Please select camera from map
th: กรุณาเลือกกล้องจากแผนที่

# oldSpeedToNewSpeed
source: Old speed: {oldSpeed} km/h → New: {newSpeed} km/h
th: ความเร็วเดิม: {oldSpeed} km/h → ใหม่: {newSpeed} km/h

# locationExampleHint
source: e.g. Near Robinson Intersection, In front of school, Opposite gas station, Bridge area
th: เช่น ใกล้ห้าแยกโรบินสัน, หน้าโรงเรียน, ตรงข้ามปั๊มน้ำมัน, บริเวณสะพาน

source: Please login before reporting camera
th: กรุณาล็อกอินก่อนรายงานกล้อง

# coordinatesFormat
source: Latitude: {lat}, Longitude: {lng}
th: ละติจูด: {lat}, ลองจิจูด: {lng}

source: Select Camera
th: เลือกกล้อง

# cannotFindCurrentLocationEnableGPS
source: Cannot find current location, please enable GPS
th: ไม่สามารถหาตำแหน่งปัจจุบันได้ กรุณาเปิด GPS

source: Select
th: เลือก

# speedLimitFormat
source: Speed limit: {limit} km/h
th: จำกัดความเร็ว: {limit} km/h

source: Confirm Selection
th: ยืนยันการเลือก

source: Tap camera icon on map to select
th: แตะที่ไอคอนกล้องบนแผนที่เพื่อเลือก

# cameraNotFoundInSystem
source: Camera data not found in system
th: ไม่พบข้อมูลกล้องในระบบ

source: Error loading data
th: เกิดข้อผิดพลาดในการโหลดข้อมูล

source: Select Camera from Map
th: เลือกกล้องจากแผนที่

# searchingCurrentLocation
source: Searching for current location...
th: กำลังหาตำแหน่งปัจจุบัน...

source: Found current location
th: พบตำแหน่งปัจจุบันแล้ว

# cannotFindLocationUseMap
source: Cannot find location, use map to search for cameras instead
th: ไม่สามารถหาตำแหน่งได้ ใช้แผนที่ค้นหากล้องแทน

# pleaseAllowLocationAccess
source: Please allow location access in app settings
th: กรุณาอนุญาตการเข้าถึงตำแหน่งในการตั้งค่าแอป

# showingBangkokMapNormalSearch
source: Showing Bangkok map (camera search works normally)
th: แสดงแผนที่กรุงเทพฯ (ค้นหากล้องได้ปกติ)

# selectedCameraInfo
source: Selected Camera
th: กล้องที่เลือก

# cameraCode
source: Code: {code}
th: รหัส: {code}

# speedAndType
source: Speed: {speed} km/h • {type}
th: ความเร็ว: {speed} km/h • {type}

# camerasCount
source: {count} cameras
th: {count} กล้อง

source: Confirm
th: ยืนยัน

source: My Report
th: รายงานของฉัน

source: Community Member
th: สมาชิกในชุมชน

source: Delete Report
th: ลบรายงาน

# speedLimitDisplay
source: Speed limit: {speed} km/h
th: จำกัดความเร็ว: {speed} km/h

# viewMapButton
source: View Map
th: ดูแผนที่

source: View Camera on Map
th: ดูกล้องในแผนที่

# viewLocationTitle
source: View Location: {roadName}
th: ดูตำแหน่ง: {roadName}

source: Win
th: ชนะ

# tied
source: Tied 3-3
th: เสมอ 3-3

# needsMoreVotes
source: Needs {count} more votes
th: ต้องการ {count} โหวต

source: Exists
th: มีจริง

# trueVote
source: True
th: จริง

source: Does Not Exist
th: ไม่มี

# falseVote
source: False
th: ไม่จริง

source: Confirm Deletion
th: ยืนยันการลบ

# deleteConfirmMessage
source: Do you want to delete this report? Once deleted, it cannot be recovered.
th: คุณต้องการลบรายงานนี้ใช่หรือไม่? เมื่อลบแล้วจะไม่สามารถกู้คืนได้

source: Delete
th: ลบ

source: Deleting report...
th: กำลังลบรายงาน...

# reportDeletedSuccess
source: Report deleted successfully 🎉 Updating screen...
th: ลบรายงานเรียบร้อยแล้ว 🎉 กำลังอัปเดตหน้าจอ...

# deleteTimeoutError
source: Deletion took too long, please try again
th: การลบใช้เวลานานเกินไป กรุณาลองใหม่

# newCameraType
source: 📷 New Camera
th: 📷 กล้องใหม่

# removedCameraType
source: ❌ Camera Removed
th: ❌ กล้องถูกถอด

# speedChangedType
source: ⚡ Speed Changed
th: ⚡ เปลี่ยนความเร็ว

# yourReportPending
source: Your Report - Pending Votes
th: รายงานของคุณ - รอโหวต

# alreadyVotedStatus
source: You Have Already Voted
th: คุณได้โหวตแล้ว

source: Pending Review
th: รอการตรวจสอบ

source: Verified
th: ยืนยันแล้ว

source: Rejected
th: ถูกปฏิเสธ

# duplicate
source: Duplicate Data
th: ข้อมูลซ้ำ

source: Just now
th: เมื่อสักครู่

# minutesAgo
source: {minutes} minutes ago
th: {minutes} นาทีที่แล้ว

# hoursAgo
source: {hours} hours ago
th: {hours} ชั่วโมงที่แล้ว

# daysAgo
source: {days} days ago
th: {days} วันที่แล้ว

source: Location access denied
th: ไม่ได้รับอนุญาตให้เข้าถึงตำแหน่ง

# enableLocationInSettings
source: Please enable location access in settings
th: กรุณาเปิดอนุญาตตำแหน่งในการตั้งค่า

# speedCameraTitle
source: Speed Camera
th: กล้องจับความเร็ว

# soundSettingsTooltip
source: Sound Alert Settings
th: ตั้งค่าเสียงแจ้งเตือน

# loadingDataText
source: Loading data...
th: กำลังโหลดข้อมูล...

source: Cannot determine location
th: ไม่สามารถระบุตำแหน่งได้

source: Cannot load speed camera data
th: ไม่สามารถโหลดข้อมูลกล้องจับความเร็วได้

# speedLimitText
source: Limit
th: จำกัด

# predictedCameraAlert
source: Predicted speed camera in 10 seconds on {roadName} limit {speedLimit} km/h
th: คาดการณ์ จะพบกล้องจับความเร็วใน 10 วินาที บน {roadName} จำกัด {speedLimit} กิโลเมตรต่อชั่วโมง

# nearCameraReduceSpeed
source: Near speed camera, please reduce speed
th: อยู่ใกล้กล้องจับความเร็ว โปรดลดความเร็ว

# nearCameraGoodSpeed
source: Near speed camera, appropriate speed
th: อยู่ใกล้กล้องจับความเร็ว ความเร็วเหมาะสม

# cameraAheadDistance
source: Speed camera ahead {distance}m limit {speedLimit} km/h
th: กล้องจับความเร็วข้างหน้า {distance} เมตร จำกัด {speedLimit} กิโลเมตรต่อชั่วโมง

# speedCameraBadgeTitle
source: Speed Camera
th: กล้องจับความเร็ว

# badgeUpdatingCameraData
source: Updating camera data...
th: กำลังอัปเดตข้อมูลกล้อง...

# badgeFoundNewCameras
source: 🎉 Found {count} new community verified cameras!
th: 🎉 พบกล้องใหม่ {count} จุด ที่ชุมชนยืนยัน!

# badgeCameraDataUpdated
source: ✅ Camera data updated successfully
th: ✅ ข้อมูลกล้องอัปเดตเรียบร้อย

# badgeCannotUpdateData
source: ⚠️ Cannot update data
th: ⚠️ ไม่สามารถอัปเดตข้อมูลได้

# badgeSecurityAnomalyDetected
source: 🔒 System detected abnormal usage
th: 🔒 ระบบตรวจพบการใช้งานผิดปกติ

# badgeSystemBackToNormal
source: ✅ System back to normal operation
th: ✅ ระบบกลับสู่การทำงานปกติ

# badgePredictedCameraAhead
source: 🔮 Camera detected in 10 seconds
th: 🔮 จะพบกล้องใน 10 วินาที

# badgeNearCameraReduceSpeed
source: ⚠️ Near camera, please reduce speed
th: ⚠️ อยู่ใกล้กล้อง โปรดลดความเร็ว

# badgeNearCameraGoodSpeed
source: ✅ Near camera, appropriate speed
th: ✅ อยู่ใกล้กล้อง ความเร็วเหมาะสม

# badgeExceedingSpeed
source: 🚨 Exceeding {excessSpeed} km/h
th: 🚨 เร็วเกิน {excessSpeed} km/h

# badgeCameraAhead
source: 📍 Camera ahead {distance}m
th: 📍 กล้องข้างหน้า {distance}m

# badgeRadarDetection
source: 🔊 Camera radar {distance}m
th: 🔊 เรดาร์กล้อง {distance}m

# soundTypeNone
source: Silent
th: ปิดเสียง

# soundTypeBeep
source: Real beep sound (not recommended)
th: เสียงบี๊บจริง (ไม่แนะนำ)

# soundTypeWarning
source: Real warning siren (not recommended)
th: เสียงเตือนภัยจริง (ไม่แนะนำ)

# soundTypeTts
source: Thai voice
th: เสียงพูดภาษาไทย

# ttsDistanceKilometer
source: {distance} kilometers
th: {distance} กิโลเมตร

# ttsDistanceMeter
source: {distance} meters
th: {distance} เมตร

# ttsCameraDistance
source: Speed camera is {distance} away from you
th: กล้องจับความเร็วอยู่ห่างจากคุณ {distance}

# ttsEnteringRoadSpeed
source: Entering {roadName} speed limit {speedLimit} kilometers per hour
th: กำลังเข้าสู่ {roadName} จำกัดความเร็ว {speedLimit} กิโลเมตรต่อชั่วโมง

# ttsBeep
source: Beep
th: บี๊บ

# ttsWarning
source: Warning
th: เตือนภัย

# ttsTestVoice
source: Test Thai voice
th: ทดสอบเสียงภาษาไทย

# ttsCameraExample
source: Speed camera ahead speed limit 90 kilometers per hour
th: กล้องจับความเร็วข้างหน้า จำกัดความเร็ว 90 กิโลเมตรต่อชั่วโมง

source: No message
th: ไม่มีข้อความ

source: Other
th: อื่นๆ

source: Report
th: รายงาน

# error
source: Error occurred
th: เกิดข้อผิดพลาด

# errorWithDetails
source: Error occurred: {error}
th: เกิดข้อผิดพลาด: {error}

source: Category ({count})
th: ประเภท ({count})

source: Urgent
th: แจ้งด่วน

source: Listing
th: รายการ

# locationPermissionDenied
source: Location access denied
th: ไม่ได้รับอนุญาตให้เข้าถึงตำแหน่ง

# enableLocationPermission
source: Please enable location access in settings
th: กรุณาเปิดอนุญาตตำแหน่งในการตั้งค่า

source: Cannot determine current location
th: ไม่สามารถระบุตำแหน่งปัจจุบันได้

# coordinateValidationError
source: Invalid coordinates: Latitude (-90 to 90), Longitude (-180 to 180)
th: พิกัดไม่ถูกต้อง: Latitude (-90 ถึง 90), Longitude (-180 ถึง 180)

# invalidCoordinates
source: Invalid coordinate format
th: รูปแบบพิกัดไม่ถูกต้อง

# cameraLocation
source: Camera location - {roadName}
th: ตำแหน่งกล้อง - {roadName}

# closeButton
source: Close
th: ปิด

# manualCoordinates
source: Enter coordinates manually
th: ป้อนพิกัดโดยตรง

# tapMapToSelect
source: Or tap on map to select location
th: หรือแตะบนแผนที่เพื่อเลือกตำแหน่ง

# roadNameFieldLabel
source: Road name
th: ชื่อถนน

# roadNameHintText
source: Road name will be displayed automatically or type manually
th: ชื่อถนนจะแสดงอัตโนมัติ หรือพิมพ์เอง

# selectedLocationText
source: Selected location:
th: ตำแหน่งที่เลือก:

# cameraLocationText
source: Camera location:
th: ตำแหน่งกล้อง:

# speedLimitInfo
source: Speed limit: {speedLimit} km/h
th: จำกัดความเร็ว: {speedLimit} km/h

source: No details
th: ไม่มีรายละเอียด

# noLocation
source: No location specified
th: ไม่ระบุตำแหน่ง

source: Details
th: รายละเอียด

source: Location
th: สถานที่

# coordinatesLabel
source: Coordinates
th: พิกัด

# closeDialog
source: Close
th: ปิด

# removedDetailPage
source: Detail page has been removed
th: หน้ารายละเอียดถูกลบออกแล้ว

source: View Details
th: ดูรายละเอียด

# saveSettingsSuccess
source: ✅ Settings saved successfully
th: ✅ บันทึกการตั้งค่าเรียบร้อย

# saveSettingsError
source: ❌ Error occurred: {error}
th: ❌ เกิดข้อผิดพลาด: {error}

source: 🔔 Testing notification...
th: 🔔 กำลังทดสอบการแจ้งเตือน...

source: ✅ Test notification sent
th: ✅ ส่งการแจ้งเตือนทดสอบแล้ว

# testNotificationError
source: ❌ Error testing: {error}
th: ❌ เกิดข้อผิดพลาดในการทดสอบ: {error}

# notificationTitle
source: Notifications
th: การแจ้งเตือน

# saveSettingsTooltip
source: Save settings
th: บันทึกการตั้งค่า

# mainSettingsTitle
source: ⚙️ Main Settings
th: ⚙️ การตั้งค่าหลัก

# enableNotificationTitle
source: Enable Notifications
th: เปิดการแจ้งเตือน

# enableNotificationSubtitle
source: Receive notifications from CheckDarn app
th: รับการแจ้งเตือนจากแอป CheckDarn

# notificationTypesTitle
source: 🔔 Notification Types
th: 🔔 ประเภทการแจ้งเตือน

# newEventsTitle
source: New Events
th: เหตุการณ์ใหม่

# newEventsSubtitle
source: Notify when new events are reported near you
th: แจ้งเตือนเมื่อมีเหตุการณ์ใหม่ในบริเวณใกล้คุณ

# commentsSubtitle
source: Notify when someone comments on your posts
th: แจ้งเตือนเมื่อมีคนแสดงความคิดเห็นในโพสต์ของคุณ

# systemTitle
source: System
th: ระบบ

# systemSubtitle
source: System notifications and updates
th: แจ้งเตือนจากระบบและการอัปเดต

# statusTitle
source: 📊 Status
th: 📊 สถานะ

# userTitle
source: User
th: ผู้ใช้

# deviceTitle
source: Device
th: อุปกรณ์

# deviceConnected
source: Connected
th: เชื่อมต่อแล้ว

# notificationDisabled
source: Notifications disabled
th: ปิดการแจ้งเตือน

# testTitle
source: 🧪 Test
th: 🧪 ทดสอบ

source: Test Notification
th: ทดสอบการแจ้งเตือน

# tipsTitle
source: 💡 Tips
th: 💡 คำแนะนำ

# privacySettingTitle
source: Privacy
th: ความเป็นส่วนตัว

# privacySettingSubtitle
source: We won't notify you when you post yourself
th: เราจะไม่แจ้งเตือนให้คุณเมื่อคุณโพสต์เอง

# batterySavingTitle
source: Battery Saving
th: ประหยัดแบตเตอรี่

# batterySavingSubtitle
source: Turn off unnecessary notifications to save battery
th: ปิดการแจ้งเตือนที่ไม่จำเป็นเพื่อประหยัดแบตเตอรี่

# loginProcessStarted
source: 🚀 Starting login process...
th: 🚀 เริ่มกระบวนการล็อกอิน...

# loginSuccessWelcome
source: Login successful! Welcome {name}
th: เข้าสู่ระบบสำเร็จ! ยินดีต้อนรับ {name}

# loginFailed
source: Login failed: {error}
th: ล็อกอินไม่สำเร็จ: {error}

# platformDescription
source: Event reporting platform for your community
th: แพลตฟอร์มรายงานเหตุการณ์ ในชุมชนของคุณ

source: Signing in...
th: กำลังเข้าสู่ระบบ...

source: Sign in with Google
th: เข้าสู่ระบบด้วย Google

source: Skip for now
th: ข้ามไปก่อน

# loginBenefit
source: Signing in allows you to report events and comment
th: การเข้าสู่ระบบจะช่วยให้คุณสามารถ รายงานเหตุการณ์และแสดงความคิดเห็นได้

source: Welcome
th: ยินดีต้อนรับ

# appSlogan
source: "Know First, Survive First, Safe First"
th: "รู้ก่อน รอดก่อน ปลอดภัยก่อน"

# appVersion
source: Version 1.0
th: เวอร์ชัน 1.0

source: Ready to test
th: พร้อมทดสอบ

source: Already logged in
th: ล็อกอินแล้ว

source: Not logged in
th: ยังไม่ล็อกอิน

source: Testing login...
th: กำลังทดสอบล็อกอิน...

# startLoginTest
source: 🧪 Starting login test...
th: 🧪 เริ่มทดสอบการล็อกอิน...

# loginSuccessEmail
source: Login successful: {email}
th: ล็อกอินสำเร็จ: {email}

# loginSuccessName
source: Login successful: {name}
th: ล็อกอินสำเร็จ: {name}

source: User cancelled login
th: ผู้ใช้ยกเลิกการล็อกอิน

# loginTestFailed
source: ❌ Login test failed: {error}
th: ❌ ทดสอบล็อกอินล้มเหลว: {error}

# loginFailedGeneral
source: Login failed: {error}
th: ล็อกอินล้มเหลว: {error}

source: Logged out
th: ออกจากระบบแล้ว

# logoutSuccess
source: Logout successful
th: ออกจากระบบสำเร็จ

source: Logout failed: {error}
th: ออกจากระบบล้มเหลว: {error}

# loginTestTitle
source: Login Test
th: ทดสอบการล็อกอิน

# loginStatusTitle
source: Login Status
th: สถานะการล็อกอิน

# userDataTitle
source: User Data
th: ข้อมูลผู้ใช้

# testingTitle
source: Testing
th: การทดสอบ

source: Testing...
th: กำลังทดสอบ...

source: Test Login
th: ทดสอบการล็อกอิน

# logoutButton
source: Logout
th: ออกจากระบบ

# notesTitle
source: Notes:
th: หมายเหตุ:

# debugConsole
source: • Check Console/Log for debug details
th: • ดู Console/Log เพื่อรายละเอียดการ debug

# checkGoogleServices
source: • Check Google Services and Firebase Console
th: • ตรวจสอบ Google Services และ Firebase Console

# checkSHA1
source: • Check SHA-1 fingerprint in Firebase
th: • ตรวจสอบ SHA-1 fingerprint ใน Firebase

# testOnDevice
source: • Test on real device, not Emulator
th: • ทดสอบบนอุปกรณ์จริง ไม่ใช่ Emulator

# simpleTestReady
source: Ready to test
th: พร้อมทดสอบ

# simpleTesting
source: Testing...
th: กำลังทดสอบ...

# simpleTestStart
source: 🧪 === Starting login test ===
th: 🧪 === เริ่มทดสอบการล็อกอิน ===

# authServiceInitialized
source: AuthService initialized Login status: {status}
th: เริ่มต้น AuthService แล้ว สถานะล็อกอิน: {status}

# categoryWithCount
source: Category ({count})
th: ประเภท ({count})

# urgentReport
source: Urgent
th: แจ้งด่วน

# listView
source: List
th: รายการ

# postStatisticsTitle
source: 📊 Post Statistics
th: 📊 สถิติโพสต์

# totalPostsWithEmoji
source: 📄 Total posts: {count} items
th: 📄 โพสต์ทั้งหมด: {count} รายการ

# freshPostsWithEmoji
source: ✨ Fresh posts (24 hrs): {count} items
th: ✨ โพสต์สดใหม่ (24 ชม.): {count} รายการ

# oldPostsWithEmoji
source: 🗑️ Old posts: {count} items
th: 🗑️ โพสต์เก่า: {count} รายการ

# autoDeleteInfo
source: 💡 Posts will be automatically deleted after 24 hours to maintain data freshness
th: 💡 โพสต์จะถูกลบอัตโนมัติหลัง 24 ชั่วโมง เพื่อรักษาความสดใหม่ของข้อมูล

# cleanupOldPosts
source: 🧹 Delete old posts now
th: 🧹 ลบโพสต์เก่าตอนนี้

# cleaningPosts
source: 🧹 Deleting old posts...
th: 🧹 กำลังลบโพสต์เก่า...

# cleanupComplete
source: ✅ Cleanup complete! {count} fresh posts remaining
th: ✅ ลบเสร็จแล้ว! เหลือโพสต์สดใหม่ {count} รายการ

# cleanupError
source: Error deleting posts: {error}
th: เกิดข้อผิดพลาดในการลบ: {error}

# postStatisticsTooltip
source: View post statistics
th: ดูสถิติโพสต์

# loadingDataError
source: Error occurred: {error}
th: เกิดข้อผิดพลาด: {error}

# loadingText
source: Loading data...
th: กำลังโหลดข้อมูล...

# noReportsTitle
source: No reports yet
th: ยังไม่มีรายการแจ้งเหตุ

# startReporting
source: Start with your first report
th: เริ่มต้นด้วยการแจ้งเหตุครั้งแรกของคุณ

# reportListTitle
source: Report List
th: รายการแจ้งเหตุ

# unspecifiedLocation
source: Location not specified
th: ไม่ระบุสถานที่

source: Show Comments
th: แสดงความคิดเห็น

# eventsInAreaFull
source: Events in this area ({count} items)
th: เหตุการณ์ในบริเวณนี้ ({count} รายการ)

# unspecifiedUser
source: Unspecified
th: ไม่ระบุชื่อ

# unknownUser
source: Anonymous user
th: ผู้ใช้ไม่ระบุชื่อ

# maskedUserFallback
source: Anonymous user
th: ผู้ใช้ไม่ระบุชื่อ

# loginSuccessWithName
source: Login successful! Welcome {name}
th: ล็อกอินสำเร็จ! ยินดีต้อนรับ {name}

# loginError
source: Login error: {error}
th: เกิดข้อผิดพลาดในการล็อกอิน: {error}

source: Logout successful
th: ล็อกเอาต์เรียบร้อยแล้ว

# logoutError
source: Logout error: {error}
th: เกิดข้อผิดพลาดในการล็อกเอาต์: {error}

# loginThroughMapRequired
source: Please login through map profile
th: กรุณาล็อกอินผ่านโปรไฟล์ในหน้าแผนที่

# fallbackOther
source: Other
th: อื่นๆ

source: User
th: ผู้ใช้

# defaultUser
source: User
th: ผู้ใช้

source: Anonymous
th: ไม่ระบุชื่อ

# roadNamePlaceholder
source: Road name
th: ชื่อถนน

# eventLocationLabel
source: Event location
th: ตำแหน่งเหตุการณ์

source: Unspecified
th: ไม่ระบุ

# securityTimeout
source: Security check timeout
th: ตรวจสอบสิทธิ์เกินเวลา

# locationRequest
source: 📍 Requesting current location...
th: 📍 กำลังขอตำแหน่งปัจจุบัน...

# locationReceived
source: ✅ Location received: {location}
th: ✅ ได้ตำแหน่ง: {location}

# cannotGetLocationManual
source: Cannot determine location. Please select location manually
th: ไม่สามารถระบุตำแหน่งได้ กรุณาเลือกตำแหน่งด้วยตนเอง

# reportTimeoutWarning
source: Report submission timeout. Please check internet connection
th: การส่งรายงานเกินเวลา กรุณาตรวจสอบการเชื่อมต่ออินเทอร์เน็ต

# reportSuccessTitle
source: Success
th: สำเร็จ

# reportTimeoutError
source: Failed to submit report: Timeout. Please check your internet connection
th: ส่งรายงานไม่สำเร็จ: เกินเวลารอคอย กรุณาตรวจสอบการเชื่อมต่ออินเทอร์เน็ต
