Repository: krit1989/checkdarn-app
Catalog: lib/l10n/app_*.arb
Languages: th

# searchingPostsInArea
source: Searching for posts in this area...
th: กำลังค้นหาโพสในบริเวณนี้...

# movedToViewPosts
source: Moved to view posts in area: {locationName}
th: ย้ายไปดูโพสในบริเวณ: {locationName}

source: Selected location
th: ตำแหน่งที่เลือก

source: Cannot load image
th: ไม่สามารถโหลดรูปภาพได้

source: Comments
th: ความคิดเห็น

source: No title
th: ไม่มีหัวข้อ

source: Anonymous user
th: ผู้ใช้ไม่ระบุชื่อ

# myLocationTooltip
source: Back to my real location
th: กลับมาตำแหน่งจริงของฉัน

# eventsInArea
source: Events in this area ({count} items)
th: เหตุการณ์ในบริเวณนี้ ({count} รายการ)

# kilometerShort
source: km
th: กม.

# cannotGetLocationInfo
source: Cannot retrieve location information: {error}
th: ไม่สามารถดึงข้อมูลตำแหน่งได้: {error}

source: Unknown location
th: ตำแหน่งที่ไม่ทราบ

source: Zoom in
th: ขยายเข้า

source: Zoom out
th: ขยายออก

# cannotLoadData
source: Cannot load data: {error}
th: ไม่สามารถโหลดข้อมูลได้: {error}

source: Try again
th: ลองใหม่

source: Emergency
th: ฉุกเฉิน

# category
source: Type
th: ประเภท

# reportWhat
source: Report
th: แจ้งอะไร?

source: Near Me
th: ใกล้ฉัน

# speedCamera
source: Camera
th: กล้อง

source: Emergency Numbers
th: เบอร์ฉุกเฉิน

source: Police
th: ตำรวจ

source: Traffic
th: จราจร

# highway
source: Highway Department
th: กรมทางหลวง

source: Rural Road
th: ทางหลวงชนบท

source: Fire Department
th: ดับเพลิง

# emergencyMedical
source: Emergency Medical Services (EMS)
th: หน่วยแพทย์ฉุกเฉิน (EMS)

# erawanCenter
source: Erawan Center (Bangkok)
th: ศูนย์เอราวัณ (กทม.)

source: Disaster Alert
th: เตือนภัยพิบัติ

source: Bomb Threat / Terrorism
th: วางเพลิง / ก่อการร้าย

# diseaseControl
source: Disease Control Center
th: ศูนย์ควบคุมโรค

# disasterPrevention
source: Disaster Prevention and Mitigation (DDPM)
th: ป้องกันและบรรเทาสาธารณภัย (ปภ.)

# ruamkatanyu
source: Ruamkatanyu Foundation
th: มูลนิธิร่วมกตัญญู

# pohtecktung
source: Poh Teck Tung Foundation
th: มูลนิธิป่อเต็กตึ๊ง

source: Cyber Crime Hotline
th: สายด่วนไซเบอร์

# consumerProtection
source: Office of Consumer Protection Board (OCPB)
th: สำนักงานคุ้มครองผู้บริโภค (สคบ.)

source: JS.100
th: จส.100

source: Tourist Police
th: ตำรวจท่องเที่ยว

# tourismAuthority
source: Tourism Authority of Thailand (TAT)
th: การท่องเที่ยวแห่งประเทศไทย (ททท.)

source: Harbor Department
th: กรมเจ้าท่า

source: Water Accident
th: อุบัติเหตุทางน้ำ

# expressway
source: Expressway Authority of Thailand
th: การทางพิเศษแห่งประเทศไทย (ทางด่วน)

source: Transport Cooperative
th: ขสมก.

source: Bus / Van
th: รถโดยสาร / รถตู้

source: Taxi / Grab
th: แท็กซี่ / Grab

# meaElectricity
source: Metropolitan Electricity Authority (MEA)
th: การไฟฟ้านครหลวง (MEA)

# peaElectricity
source: Provincial Electricity Authority (PEA)
th: การไฟฟ้าส่วนภูมิภาค (PEA)

# cannotCallPhone
source: Cannot call {phoneNumber} Please check if device supports phone calls
th: ไม่สามารถโทรหาเบอร์ {phoneNumber} ได้ กรุณาตรวจสอบว่าอุปกรณ์รองรับการโทรออก

source: Select Category
th: เลือกประเภท

# selectedOfTotal
source: {selected} of {total} items
th: {selected} จาก {total} รายการ

# categoryCheckpoint
source: Checkpoint
th: ด่านตรวจ

# categoryAccident
source: Accident
th: อุบัติเหตุ

# categoryFire
source: Fire
th: ไฟไหม้

# categoryFloodRain
source: Rain/Flood
th: ฝนตก/น้ำท่วม

# categoryTsunami
source: Tsunami
th: สึนามิ

# categoryEarthquake
source: Earthquake
th: แผ่นดินไหว

# categoryAnimalLost
source: Lost Animal
th: สัตว์เลี้ยงหาย

# categoryQuestion
source: General Question
th: คำถามทั่วไป

source: Settings
th: การตั้งค่า

source: Notifications
th: การแจ้งเตือน

source: Speed Camera Sound Alert
th: เสียงเตือนกล้องจับความเร็ว

source: Enable Notifications
th: เปิดการแจ้งเตือน

# enableNotificationsDesc
source: Notify when new events occur
th: แจ้งเตือนเมื่อมีเหตุการณ์ใหม่

source: General
th: ทั่วไป

source: Thai Voice
th: เสียงไทย

source: Language
th: ภาษา

source: Select Language
th: เลือกภาษา

source: Thai
th: ไทย

source: Currently Selected
th: ถูกเลือกอยู่แล้ว

source: Coming Soon!
th: เร็ว ๆ นี้!

source: Close
th: ปิด

source: Share App
th: แชร์แอป

# shareAppDesc
source: Share app with friends
th: แชร์แอปกับเพื่อน ๆ

source: Review App
th: รีวิวแอป

# reviewAppDesc
source: Rate app on App Store
th: ให้คะแนนแอปใน App Store

source: About App
th: เกี่ยวกับแอป

source: Version
th: เวอร์ชัน

source: Terms of Service
th: ข้อกำหนดการใช้งาน

source: Privacy Policy
th: นโยบายความเป็นส่วนตัว

source: Contact Us
th: ติดต่อเรา

# sendFeedbackOrReport
source: Send feedback or report issues
th: ส่งข้อเสนอแนะหรือรายงานปัญหา

source: Email
th: อีเมล

source: Open email app
th: เปิดแอปอีเมล

source: Report Problem
th: รายงานปัญหา

# reportProblemDesc
source: Report usage issues
th: แจ้งปัญหาการใช้งาน

source: Report feature coming soon!
th: ฟีเจอร์รายงานปัญหาเร็ว ๆ นี้!

# logoutTitle
source: Logout
th: ออกจากระบบ

# logoutMessage
source: Do you want to logout?
th: คุณต้องการออกจากระบบหรือไม่?

source: Cancel
th: ยกเลิก

source: Logout
th: ออกจากระบบ

source: Security validation failed
th: การตรวจสอบความปลอดภัยล้มเหลว

source: Logout failed
th: การออกจากระบบล้มเหลว

source: Welcome to
th: ยินดีต้อนรับสู่

# termsOfServiceTitle
source: Terms of Service
th: เงื่อนไขการใช้งาน

# termsOfServiceHeader
source: 📋 CheckDarn Terms of Service
th: 📋 เงื่อนไขการใช้งาน CheckDarn

# lastUpdated
source: Last Updated: August 8, 2025
th: อัปเดตล่าสุด: 8 สิงหาคม 2568

# acceptanceOfTermsTitle
source: 1. Acceptance of Terms
th: 1. การยอมรับเงื่อนไข

# acceptanceOfTermsContent
source: By using the CheckDarn application, you agree to accept and comply with all terms of service. If you do not accept these terms, please stop using the application immediately.
th: การใช้งานแอปพลิเคชัน CheckDarn ถือว่าท่านยอมรับและตกลงที่จะปฏิบัติตามเงื่อนไขการใช้งานทั้งหมด หากท่านไม่ยอมรับเงื่อนไขเหล่านี้ กรุณาหยุดใช้งานแอปพลิเคชันทันที

# purposeOfUseTitle
source: 2. Purpose of Use
th: 2. วัตถุประสงค์การใช้งาน

# purposeOfUseContent
source: CheckDarn is an application for reporting and alerting various events in the area, such as traffic, accidents, or other important events to help the community receive useful information.
th: CheckDarn เป็นแอปพลิเคชันสำหรับรายงานและแจ้งเตือนเหตุการณ์ต่างๆ ในพื้นที่ เช่น การจราจร อุบัติเหตุ หรือเหตุการณ์สำคัญอื่นๆ เพื่อช่วยให้ชุมชนได้รับข้อมูลข่าวสารที่เป็นประโยชน์

# appropriateUseTitle
source: 3. Appropriate Use
th: 3. การใช้งานที่เหมาะสม

# appropriateUseContent
source: Users must use the application responsibly. Do not post false, offensive, or illegal information. Reported information should be factual and beneficial to the community.
th: ผู้ใช้ต้องใช้งานแอปพลิเคชันด้วยความรับผิดชอบ ไม่โพสต์ข้อมูลที่เป็นเท็จ หยาบคาย หรือผิดกฎหมาย ข้อมูลที่รายงานควรเป็นข้อเท็จจริงและเป็นประโยชน์ต่อส่วนรวม

# privacyTitle
source: 4. Privacy
th: 4. ความเป็นส่วนตัว

# privacyContent
source: We value user privacy. Personal data will be kept secure and used only for service development and improvement purposes.
th: เราให้ความสำคัญกับความเป็นส่วนตัวของผู้ใช้ ข้อมูลส่วนบุคคลจะถูกเก็บรักษาอย่างปลอดภัยและใช้เฉพาะเพื่อการพัฒนาและปรับปรุงบริการเท่านั้น

# responsibilityTitle
source: 5. Responsibility
th: 5. การรับผิดชอบ

# responsibilityContent
source: Application developers are not responsible for any damages arising from the use of the application. Users must use their judgment when making decisions based on received information.
th: ผู้พัฒนาแอปพลิเคชันไม่รับผิดชอบต่อความเสียหายใดๆ ที่เกิดจากการใช้งานแอปพลิเคชัน ผู้ใช้ต้องใช้วิจารณญาณในการตัดสินใจจากข้อมูลที่ได้รับ

# modificationsTitle
source: 6. Terms Modifications
th: 6. การแก้ไขเงื่อนไข

# modificationsContent
source: We reserve the right to modify the terms of service at any time. Modifications will take effect immediately after being announced in the application.
th: เราสงวนสิทธิ์ในการแก้ไขเงื่อนไขการใช้งานได้ตลอดเวลา การแก้ไขจะมีผลทันทีหลังจากประกาศในแอปพลิเคชัน

# contactTitle
source: 7. Contact
th: 7. การติดต่อ

# contactContent
source: If you have questions or need to contact regarding the terms of service, you can contact through the application or designated channels.
th: หากมีข้อสงสัยหรือต้องการติดต่อเกี่ยวกับเงื่อนไขการใช้งาน สามารถติดต่อผ่านทางแอปพลิเคชันหรือช่องทางที่กำหนด

# thankYouForUsing
source: ✅ Thank you for using CheckDarn
th: ✅ ขอบคุณที่ใช้งาน CheckDarn

# communityMessage
source: Together building a safe community with good information
th: ร่วมสร้างชุมชนที่ปลอดภัยและมีข้อมูลข่าวสารที่ดี

# privacyPolicyTitle
source: Privacy Policy
th: นโยบายความเป็นส่วนตัว

# privacyPolicyHeader
source: 🔒 CheckDarn Privacy Policy
th: 🔒 นโยบายความเป็นส่วนตัว CheckDarn

# effectiveFrom
source: Effective from: August 8, 2025
th: มีผลตั้งแต่: 8 สิงหาคม 2568

# dataCollectionTitle
source: 1. Data We Collect
th: 1. ข้อมูลที่เราเก็บรวบรวม

# dataCollectionContent
source: We collect information when you use the CheckDarn application, including: • Account Information: Email, username, profile picture • Location Data: GPS location to display and report events • Usage Data: Access time, reporting types • Device Information: Mobile model, operating system
th: เราเก็บรวบรวมข้อมูลเมื่อคุณใช้งานแอปพลิเคชัน CheckDarn ประกอบด้วย: • ข้อมูลบัญชี: อีเมล ชื่อผู้ใช้ รูปโปรไฟล์ • ข้อมูลตำแหน่ง: GPS location เพื่อแสดงและรายงานเหตุการณ์ • ข้อมูลการใช้งาน: เวลาการเข้าใช้ ประเภทการรายงาน • ข้อมูลอุปกรณ์: รุ่นมือถือ ระบบปฏิบัติการ

# dataUsageTitle
source: 2. Purpose of Data Usage
th: 2. วัตถุประสงค์การใช้ข้อมูล

# dataUsageContent
source: We use your data to: • Provide event reporting and notification services • Display events on maps according to appropriate locations • Improve and develop application quality • Send necessary and relevant notifications • Maintain security and prevent inappropriate usage
th: เราใช้ข้อมูลของคุณเพื่อ: • ให้บริการรายงานและแจ้งเตือนเหตุการณ์ • แสดงเหตุการณ์บนแผนที่ตามตำแหน่งที่เหมาะสม • ปรับปรุงและพัฒนาคุณภาพแอปพลิเคชัน • ส่งการแจ้งเตือนที่จำเป็นและเกี่ยวข้อง • รักษาความปลอดภัยและป้องกันการใช้งานที่ผิดต้อง

# dataSharingTitle
source: 3. Data Sharing
th: 3. การแบ่งปันข้อมูล

# dataSharingContent
source: We do not sell or rent your personal data to third parties We may share data in the following cases: • When we receive your consent • To comply with laws or court orders • To protect users' rights and safety • Publicly disclosed information (reports that users choose to share)
th: เราไม่ขายหรือให้เช่าข้อมูลส่วนบุคคลของคุณแก่บุคคลที่สาม เราอาจแบ่งปันข้อมูลในกรณีต่อไปนี้: • เมื่อได้รับความยินยอมจากคุณ • เพื่อปฏิบัติตามกฎหมายหรือคำสั่งศาล • เพื่อปกป้องสิทธิและความปลอดภัยของผู้ใช้ • ข้อมูลที่เปิดเผยต่อสาธารณะ (รายงานที่ผู้ใช้เลือกแชร์)

# dataSecurityTitle
source: 4. Data Security
th: 4. ความปลอดภัยของข้อมูล

# dataSecurityContent
source: We prioritize protecting your data: • Use data encryption during transmission and storage • Have secure authentication systems • Limit data access to necessary personnel only • Regularly check and update security systems
th: เราให้ความสำคัญกับการปกป้องข้อมูลของคุณ: • ใช้การเข้ารหัสข้อมูลขณะส่งและจัดเก็บ • มีระบบยืนยันตัวตนที่ปลอดภัย • จำกัดการเข้าถึงข้อมูลเฉพาะบุคลากรที่จำเป็น • ตรวจสอบและอัพเดตระบบความปลอดภัยอย่างสม่ำเสมอ

# userRightsTitle
source: 5. User Rights
th: 5. สิทธิของผู้ใช้

# userRightsContent
source: You have rights regarding your personal data: • Access Right: Request to view data we collect • Correction Right: Request to correct incorrect data • Deletion Right: Request to delete personal data • Withdrawal Right: Cancel service usage at any time • Complaint Right: Report data usage issues
th: คุณมีสิทธิต่อข้อมูลส่วนบุคคลของคุณ: • สิทธิเข้าถึง: ขอดูข้อมูลที่เราเก็บรวบรวม • สิทธิแก้ไข: ขอแก้ไขข้อมูลที่ไม่ถูกต้อง • สิทธิลบ: ขอลบข้อมูลส่วนบุคคล • สิทธิถอนความยินยอม: ยกเลิกการใช้บริการได้ตลอดเวลา • สิทธิร้องเรียน: แจ้งปัญหาเกี่ยวกับการใช้ข้อมูล

# cookiesTitle
source: 6. Cookies and Tracking Technologies
th: 6. Cookies และเทคโนโลยีติดตาม

# cookiesContent
source: The application may use these technologies: • Local Storage: Store settings and temporary data • Analytics: Analyze usage to improve the app • Push Notifications: Send necessary notifications • Firebase Services: Cloud services for data storage
th: แอปพลิเคชันอาจใช้เทคโนโลยีเหล่านี้: • Local Storage: เก็บการตั้งค่าและข้อมูลชั่วคราว • Analytics: วิเคราะห์การใช้งานเพื่อปรับปรุงแอป • Push Notifications: ส่งการแจ้งเตือนที่จำเป็น • Firebase Services: บริการคลาวด์สำหรับจัดเก็บข้อมูล

# policyChangesTitle
source: 7. Policy Changes
th: 7. การเปลี่ยนแปลงนโยบาย

# policyChangesContent
source: We may update the privacy policy periodically • Will notify in advance if there are significant changes • Continued usage implies acceptance of new policy • Should check policy updates regularly
th: เราอาจปรับปรุงนโยบายความเป็นส่วนตัวเป็นครั้งคราว • จะแจ้งให้ทราบล่วงหน้าหากมีการเปลี่ยนแปลงสำคัญ • การใช้งานต่อไปถือว่ายอมรับนโยบายใหม่ • ควรตรวจสอบนโยบายอัพเดตอย่างสม่ำเสมอ

# contactPrivacyTitle
source: 8. Contact
th: 8. การติดต่อ

# contactPrivacyContent
source: If you have questions about the privacy policy: • Contact through the application • Send email to support team • Use "Contact Us" feature in settings page
th: หากมีคำถามเกี่ยวกับนโยบายความเป็นส่วนตัว: • ติดต่อผ่านแอปพลิเคชัน • ส่งอีเมลไปยังทีมสนับสนุน • ใช้ฟีเจอร์ "ติดต่อเรา" ในหน้าการตั้งค่า

# respectPrivacy
source: 🛡️ We respect your privacy
th: 🛡️ เราเคารพความเป็นส่วนตัวของคุณ

# securityMessage
source: Your data is protected with the highest security standards
th: ข้อมูลของคุณได้รับการปกป้องด้วยมาตรฐานความปลอดภัยสูงสุด

# cannotOpenEmailApp
source: Cannot open email app. Please try another method
th: ไม่สามารถเปิดแอปอีเมลได้ กรุณาลองวิธีอื่น

# emailAppOpened
source: Opening email app...
th: กำลังเปิดแอปอีเมล...

# nearMeTitle
source: Near Me
th: ใกล้ฉัน

# allCategories
source: All
th: ทั้งหมด

source: My Posts
th: โพสต์ของฉัน

source: No reports yet
th: ยังไม่มีรายการแจ้งเหตุ

# startWithFirstReport
source: Start with your first report
th: เริ่มต้นด้วยการแจ้งเหตุครั้งแรกของคุณ

source: Post Statistics
th: สถิติโพสต์

# totalPosts
source: Total posts: {count} items
th: โพสต์ทั้งหมด: {count} รายการ

# freshPosts
source: Fresh posts (24 hrs): {count} items
th: โพสต์สดใหม่ (24 ชม.): {count} รายการ

# oldPosts
source: Old posts: {count} items
th: โพสต์เก่า: {count} รายการ

# autoDeleteNotice
source: Posts will be automatically deleted after 24 hours to maintain data freshness
th: โพสต์จะถูกลบอัตโนมัติหลัง 24 ชั่วโมง เพื่อรักษาความสดใหม่ของข้อมูล

source: Delete old posts now
th: ลบโพสต์เก่าตอนนี้

source: Deleting old posts...
th: กำลังลบโพสต์เก่า...

# deleteComplete
source: Deletion complete! {count} fresh posts remaining
th: ลบเสร็จแล้ว! เหลือโพสต์สดใหม่ {count} รายการ

# deleteError
source: Error deleting posts: {error}
th: เกิดข้อผิดพลาดในการลบ: {error}

# generalError
source: An error occurred: {error}
th: เกิดข้อผิดพลาด: {error}

source: View Map
th: ดูแผนที่

source: Click to view image
th: คลิกดูรูปภาพ

# devOnly
source: View Post Statistics (Dev Only)
th: ดูสถิติโพสต์ (Dev Only)

# meters
source: m
th: ม.

# kilometers
source: km
th: กม.

# reportScreenTitle
source: Report What?
th: แจ้งอะไร?

source: Select Event Type *
th: เลือกประเภทเหตุการณ์ *

# detailsField
source: Details *
th: รายละเอียด *

source: Click to select location
th: คลิกเพื่อเลือกตำแหน่ง

# willTakeToCurrentLocation
source: Will take you to your current location *
th: จะพาไปที่ตำแหน่งปัจจุบันของคุณ *

source: Finding current location...
th: กำลังค้นหาตำแหน่งปัจจุบัน...

# loadingAddressInfo
source: Loading address information...
th: กำลังโหลดข้อมูลที่อยู่...

source: Tap to change location
th: แตะเพื่อเปลี่ยนตำแหน่ง

# imageOnlyForLostAnimals
source: Images can only be attached for "Lost Animals" reports to prevent inappropriate content
th: สามารถแนบรูปภาพได้เฉพาะในหัวข้อ "สัตว์เลี้ยงหาย" เท่านั้น เพื่อป้องกันเนื้อหาที่ไม่เหมาะสม

source: Select Image Source
th: เลือกแหล่งรูปภาพ

source: Gallery
th: แกลเลอรี่

source: Camera
th: กล้อง

# addImage
source: Add Image (Optional)
th: เพิ่มรูปภาพ (ไม่บังคับ)

source: Change
th: เปลี่ยน

# save
source: Submit
th: ส่ง

source: Sending...
th: กำลังส่ง...

# securityValidationFailedImage
source: Security validation failed. Cannot upload image
th: การตรวจสอบความปลอดภัยล้มเหลว ไม่สามารถอัปโหลดรูปภาพได้

# imageUploadSuccess
source: Image uploaded successfully!
th: อัพโหลดรูปภาพสำเร็จ!

source: Cannot process image
th: ไม่สามารถประมวลผลรูปภาพได้

# imageSelectionError
source: Error selecting image: {error}
th: เกิดข้อผิดพลาดในการเลือกรูปภาพ: {error}

# securityValidationFailedGeneral
source: Security validation failed. Please try again
th: การตรวจสอบความปลอดภัยล้มเหลว กรุณาลองใหม่อีกครั้ง

# pleaseSelectCoordinates
source: Please select coordinates: {field}
th: กรุณาเลือกพิกัด: {field}

# pleaseFillData
source: Please fill in data: {field}
th: กรุณากรอกข้อมูล: {field}

source: Event Location
th: ตำแหน่งเหตุการณ์

# userNotFound
source: User not found. Please login again
th: ไม่พบข้อมูลผู้ใช้ กรุณาล็อกอินใหม่

# dailyLimitExceeded
source: Limit exceeded: 5 posts per day. Please wait 24 hrs
th: เกินขีดจำกัด 5 โพสต์ต่อวัน กรุณารอ 24 ชม.

# cannotGetLocation
source: Cannot determine location. Please select location manually
th: ไม่สามารถระบุตำแหน่งได้ กรุณาเลือกตำแหน่งด้วยตนเอง

# success
source: Submitted successfully
th: ส่งสำเร็จ

# submitTimeoutError
source: Failed to submit report: Timeout. Please check your internet connection
th: ส่งรายงานไม่สำเร็จ: เกินเวลารอคอย กรุณาตรวจสอบการเชื่อมต่ออินเทอร์เน็ต

# submitError
source: Error submitting report
th: เกิดข้อผิดพลาดในการส่งรายงาน

# networkError
source: Network connection problem. Please check WiFi/4G
th: ปัญหาการเชื่อมต่อเครือข่าย กรุณาตรวจสอบ WiFi/4G

# permissionError
source: No upload permission. Please contact system administrator
th: ไม่มีสิทธิ์ในการอัพโหลด กรุณาติดต่อผู้ดูแลระบบ

# storageError
source: File upload problem. Please try sending without image
th: ปัญหาการอัพโหลดไฟล์ กรุณาลองส่งโดยไม่มีรูปภาพ

# fileSizeError
source: Image file too large. Please try taking a new photo
th: ไฟล์รูปใหญ่เกินไป กรุณาลองถ่ายรูปใหม่

# persistentError
source: If the problem persists, try sending without image
th: หากปัญหายังคงอยู่ ลองส่งโดยไม่มีรูปภาพ

# tryAgainAction
source: Try Again
th: ลองใหม่

source: Please select event type
th: กรุณาเลือกประเภทเหตุการณ์

# pleaseFillDetails
source: Please fill in details
th: กรุณากรอกรายละเอียด

source: Select Location
th: เลือกตำแหน่ง

# tapOnMapToSelectLocation
source: Or tap on map to select location
th: หรือแตะบนแผนที่เพื่อเลือกตำแหน่ง

source: Current Location
th: ตำแหน่งปัจจุบัน

source: Address Information
th: ข้อมูลที่อยู่

source: Road Name:
th: ชื่อถนน:

source: Sub-district:
th: ตำบล/แขวง:

source: District:
th: อำเภอ/เขต:

source: Province:
th: จังหวัด:

source: Coordinates
th: พิกัด

source: Manual coordinate entry
th: กรอกพิกัดด้วยตนเอง

source: Latitude
th: ละติจูด

source: Longitude
th: ลองติจูด

source: Apply
th: นำไป

# coordinatesOutOfRange
source: Coordinates must be in valid range
th: พิกัดต้องอยู่ในช่วงที่ถูกต้อง

source: Invalid coordinate format
th: รูปแบบพิกัดไม่ถูกต้อง

source: Confirm Location
th: ยืนยันตำแหน่ง

# cancelAction
source: Cancel
th: ยกเลิก

# roadNameHint
source: Road name will be displayed automatically or type manually
th: ชื่อถนนจะแสดงอัตโนมัติ หรือพิมพ์เอง

source: Report Comment
th: รายงานความคิดเห็น

# reportCommentConfirm
source: Do you want to report this comment as inappropriate?
th: คุณต้องการรายงานความคิดเห็นนี้ว่าไม่เหมาะสมหรือไม่?

# reportCommentSuccess
source: Comment reported successfully
th: รายงานความคิดเห็นเรียบร้อยแล้ว

# commentsTitle
source: Comments
th: ความคิดเห็น

source: No comments yet
th: ยังไม่มีความคิดเห็น

# beFirstToComment
source: Be the first to comment!
th: เป็นคนแรกที่แสดงความคิดเห็น!

# addCommentHint
source: Add comment...
th: เพิ่มความคิดเห็น...

# pleaseEnterComment
source: Please enter a comment
th: กรุณาพิมพ์ความคิดเห็น

# commentSentSuccess
source: Comment sent successfully
th: ส่งความคิดเห็นสำเร็จ

# typeCommentHint
source: Type a comment...
th: พิมพ์ความคิดเห็น...

# soundSettingsTitle
source: Sound Alert Settings
th: ตั้งค่าเสียงแจ้งเตือน

source: Enable Sound Notifications
th: เปิดใช้งานเสียงแจ้งเตือน

# enableDisableSoundDesc
source: Enable/Disable all sound alerts
th: เปิด/ปิดเสียงแจ้งเตือนทั้งหมด

# selectSoundType
source: 🔊 Select Sound Alert Type
th: 🔊 เลือกประเภทเสียงแจ้งเตือน

source: Test Sound
th: ทดสอบเสียง

# soundTips
source: 💡 Tips
th: 💡 คำแนะนำ

# soundTipsDescription
source: • Voice: Reads text aloud in Thai, provides detailed and clear information • Silent: No sound alerts, suitable for quiet places
th: • เสียงพูด: อ่านข้อความเป็นเสียงพูดภาษาไทย ให้ข้อมูลละเอียดและชัดเจน • ปิดเสียง: ไม่มีเสียงแจ้งเตือน เหมาะสำหรับสถานที่เงียบ

# noSoundDescription
source: No sound alerts, completely silent
th: ไม่มีเสียงแจ้งเตือน เงียบสนิท

# beepSoundDescription
source: Short beep sound (deprecated)
th: เสียงบี๊บสั้นๆ (เลิกใช้แล้ว)

# warningSoundDescription
source: Siren warning sound (deprecated)
th: เสียงเตือนภัยแบบไซเรน (เลิกใช้แล้ว)

# ttsSoundDescription
source: Reads text aloud in Thai - Recommended
th: อ่านข้อความเป็นเสียงพูดภาษาไทย - แนะนำ

# noSoundDisplayName
source: Silent
th: ปิดเสียง

# thaiVoiceDisplayName
source: Thai Voice
th: เสียงพูดภาษาไทย

# testSoundSuccess
source: Test sound: {soundType}
th: ทดสอบเสียง: {soundType}

# cannotPlaySound
source: Cannot play sound: {error}
th: ไม่สามารถเล่นเสียงได้: {error}

# cameraReportTitle
source: Speed Camera Reports
th: เพิ่มกล้องจับความเร็ว

source: Switch to nearby view
th: เปลี่ยนเป็นดูเฉพาะใกล้เคียง

source: Switch to nationwide view
th: เปลี่ยนเป็นดูทั่วประเทศ

# newReportTab
source: New Report
th: เพิ่มใหม่

# votingTab
source: Voting
th: โหวต

# statisticsTab
source: Statistics
th: สถิติ

# howToReportTitle
source: How to Report
th: วิธีการรายงาน

# howToReportDescription
source: • Report new cameras you encounter • Report speed limit changes • Data will be verified by the community • Once verified, the system will process automatically • You cannot vote on your own reports
th: • รายงานกล้องใหม่ที่คุณพบเจอ • รายงานการเปลี่ยนจำกัดความเร็ว • ข้อมูลจะถูกตรวจสอบโดยชุมชน • เมื่อได้รับการยืนยัน ระบบจะดำเนินการอัตโนมัติ • คุณไม่สามารถโหวตรายงานของตัวเองได้

# reportSubmittedSuccess
source: Report submitted successfully! Check in the voting tab
th: ส่งรายงานเรียบร้อยแล้ว! ตรวจสอบในแท็บโหวต

# showingNationwidePosts
source: Showing posts from nationwide
th: แสดงโพสต์จากทั่วประเทศ

source: Showing nearby posts
th: แสดงโพสต์ใกล้เคียง

# radiusKm
source: Radius: {radius} km
th: รัศมี: {radius} กม.

source: Total posts: {count}
th: โพสต์ทั้งหมด: {count}

source: Nearby posts: {count}
th: โพสต์ใกล้เคียง: {count}

source: Nearby
th: ใกล้เคียง

source: Nationwide
th: ทั่วประเทศ

source: Login required to vote
th: จำเป็นต้องล็อกอินเพื่อโหวต

# loginThroughMapProfile
source: Please login through profile on map screen
th: กรุณาล็อกอินผ่านโปรไฟล์ในหน้าแผนที่

# tapProfileButtonOnMap
source: Tap the profile button at the top right of the map
th: แตะที่ปุ่มโปรไฟล์มุมขวาบนของแผนที่

source: Loading data...
th: กำลังโหลดข้อมูล...

# noPendingReports
source: No reports pending for voting
th: ไม่มีรายงานที่รอการโหวต

# thankYouForVerifying
source: Thank you for helping verify data!
th: ขอบคุณที่ช่วยตรวจสอบข้อมูล!

source: Voting...
th: กำลังโหวต...

# voteUpvoteSuccess
source: Vote "Exists" submitted successfully
th: โหวต "มีจริง" เรียบร้อยแล้ว

# voteDownvoteSuccess
source: Vote "Doesn't exist" submitted successfully
th: โหวต "ไม่มี" เรียบร้อยแล้ว

# alreadyVoted
source: You have already voted on this report
th: คุณได้โหวตรายงานนี้แล้ว

# voteSuccessfullyRecorded
source: Vote recorded successfully! (System verified that you have voted)
th: โหวตเรียบร้อยแล้ว! (ระบบตรวจสอบว่าคุณได้โหวตแล้ว)
